{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "be8ba66d",
   "metadata": {},
   "source": [
    "HOW TO RUN NEO4J:\n",
    "\n",
    "https://AWS-PUBLIC-IP:7473\n",
    "    Example: https://3.12.45.67:7473\n",
    "\n",
    "Use login credintials:\n",
    "    Username: neo4j\n",
    "    Password: ucb_mids_w205"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "b46818bf",
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j\n",
    "import pandas as pd\n",
    "from IPython.display import display\n",
    "import numpy as np\n",
    "import requests\n",
    "from io import StringIO\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "02fe7852",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/opt/conda/lib/python3.9/site-packages/urllib3/connectionpool.py:1013: InsecureRequestWarning: Unverified HTTPS request is being made to host 'raw.githubusercontent.com'. Adding certificate verification is strongly advised. See: https://urllib3.readthedocs.io/en/1.26.x/advanced-usage.html#ssl-warnings\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " (64809, 16)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year</th>\n",
       "      <th>coo_name</th>\n",
       "      <th>coo</th>\n",
       "      <th>coo_iso</th>\n",
       "      <th>coa_name</th>\n",
       "      <th>coa</th>\n",
       "      <th>coa_iso</th>\n",
       "      <th>refugees</th>\n",
       "      <th>asylum_seekers</th>\n",
       "      <th>returned_refugees</th>\n",
       "      <th>idps</th>\n",
       "      <th>returned_idps</th>\n",
       "      <th>stateless</th>\n",
       "      <th>ooc</th>\n",
       "      <th>oip</th>\n",
       "      <th>hst</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2010</td>\n",
       "      <td>Afghanistan</td>\n",
       "      <td>AFG</td>\n",
       "      <td>AFG</td>\n",
       "      <td>Afghanistan</td>\n",
       "      <td>AFG</td>\n",
       "      <td>AFG</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>351907</td>\n",
       "      <td>3366</td>\n",
       "      <td>0</td>\n",
       "      <td>838250</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2010</td>\n",
       "      <td>Iran (Islamic Rep. of)</td>\n",
       "      <td>IRN</td>\n",
       "      <td>IRN</td>\n",
       "      <td>Afghanistan</td>\n",
       "      <td>AFG</td>\n",
       "      <td>AFG</td>\n",
       "      <td>30</td>\n",
       "      <td>21</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2010</td>\n",
       "      <td>Iraq</td>\n",
       "      <td>IRQ</td>\n",
       "      <td>IRQ</td>\n",
       "      <td>Afghanistan</td>\n",
       "      <td>AFG</td>\n",
       "      <td>AFG</td>\n",
       "      <td>6</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2010</td>\n",
       "      <td>Pakistan</td>\n",
       "      <td>PAK</td>\n",
       "      <td>PAK</td>\n",
       "      <td>Afghanistan</td>\n",
       "      <td>AFG</td>\n",
       "      <td>AFG</td>\n",
       "      <td>6398</td>\n",
       "      <td>9</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2010</td>\n",
       "      <td>Egypt</td>\n",
       "      <td>ARE</td>\n",
       "      <td>EGY</td>\n",
       "      <td>Albania</td>\n",
       "      <td>ALB</td>\n",
       "      <td>ALB</td>\n",
       "      <td>5</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   year                coo_name  coo coo_iso     coa_name  coa coa_iso  \\\n",
       "0  2010             Afghanistan  AFG     AFG  Afghanistan  AFG     AFG   \n",
       "1  2010  Iran (Islamic Rep. of)  IRN     IRN  Afghanistan  AFG     AFG   \n",
       "2  2010                    Iraq  IRQ     IRQ  Afghanistan  AFG     AFG   \n",
       "3  2010                Pakistan  PAK     PAK  Afghanistan  AFG     AFG   \n",
       "4  2010                   Egypt  ARE     EGY      Albania  ALB     ALB   \n",
       "\n",
       "   refugees  asylum_seekers  returned_refugees    idps  returned_idps  \\\n",
       "0         0               0                  0  351907           3366   \n",
       "1        30              21                  0       0              0   \n",
       "2         6               0                  0       0              0   \n",
       "3      6398               9                  0       0              0   \n",
       "4         5               0                  0       0              0   \n",
       "\n",
       "   stateless     ooc  oip  hst  \n",
       "0          0  838250  NaN  NaN  \n",
       "1          0       0  NaN  NaN  \n",
       "2          0       0  NaN  NaN  \n",
       "3          0       0  NaN  NaN  \n",
       "4          0       0  NaN  NaN  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "url = \"https://raw.githubusercontent.com/rfordatascience/tidytuesday/main/data/2023/2023-08-22/population.csv\"\n",
    "response = requests.get(url, verify=False)\n",
    "population = pd.read_csv(StringIO(response.text))\n",
    "print(\"\", population.shape)\n",
    "population.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "baed77ee",
   "metadata": {},
   "source": [
    "## Driver & Session for Neo4j Database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "eb2860a5",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = neo4j.GraphDatabase.driver(uri=\"neo4j://neo4j:7687\", auth=(\"neo4j\",\"ucb_mids_w205\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "c8077c65",
   "metadata": {},
   "outputs": [],
   "source": [
    "session = driver.session(database=\"neo4j\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c542fb36",
   "metadata": {},
   "source": [
    "## Wipe out all Nodes and Relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "9e0a32aa",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_wipe_out_database():\n",
    "    \"wipe out database by deleting all nodes and relationships\"\n",
    "    \n",
    "    query = \"match (node)-[relationship]->() delete node, relationship\"\n",
    "    session.run(query)\n",
    "    \n",
    "    query = \"match (node) delete node\"\n",
    "    session.run(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4632f3b5",
   "metadata": {},
   "source": [
    "## Put Results of Cypher Query in Pandas Dataframe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "13fd33e2",
   "metadata": {},
   "outputs": [],
   "source": [
    "def my_neo4j_run_query_pandas(query, **kwargs):\n",
    "    \"run a query and return the results in a pandas dataframe\"\n",
    "    \n",
    "    result = session.run(query, **kwargs)\n",
    "    \n",
    "    df = pd.DataFrame([r.values() for r in result], columns=result.keys())\n",
    "    \n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "85317021",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7feb9a7adcd0>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "UNWIND range(1,10) AS id\n",
    "CREATE (:Node {id:id})\n",
    "\"\"\"\n",
    "\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "f035836c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   n.id\n",
       "0     1\n",
       "1     2\n",
       "2     3\n",
       "3     4\n",
       "4     5\n",
       "5     6\n",
       "6     7\n",
       "7     8\n",
       "8     9\n",
       "9    10"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "df = my_neo4j_run_query_pandas(\"\"\"\n",
    "MATCH (n:Node)\n",
    "RETURN n.id\n",
    "\"\"\")\n",
    "\n",
    "display(df)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aa8f1002",
   "metadata": {},
   "source": [
    "## Creating the Database\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "02970c8f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>country</th>\n",
       "      <th>iso</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Cabo Verde</td>\n",
       "      <td>CPV</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>New Zealand</td>\n",
       "      <td>NZL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>China, Macao SAR</td>\n",
       "      <td>MAC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kiribati</td>\n",
       "      <td>KIR</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Austria</td>\n",
       "      <td>AUT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Andorra</td>\n",
       "      <td>AND</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Finland</td>\n",
       "      <td>FIN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Iceland</td>\n",
       "      <td>ISL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Malta</td>\n",
       "      <td>MLT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Bermuda</td>\n",
       "      <td>BMU</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            country  iso\n",
       "0        Cabo Verde  CPV\n",
       "1       New Zealand  NZL\n",
       "2  China, Macao SAR  MAC\n",
       "3          Kiribati  KIR\n",
       "4           Austria  AUT\n",
       "5           Andorra  AND\n",
       "6           Finland  FIN\n",
       "7           Iceland  ISL\n",
       "8             Malta  MLT\n",
       "9           Bermuda  BMU"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>year</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2011</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2012</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2013</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2014</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>2015</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>2016</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>2017</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>2018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>2019</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   year\n",
       "0  2010\n",
       "1  2011\n",
       "2  2012\n",
       "3  2013\n",
       "4  2014\n",
       "5  2015\n",
       "6  2016\n",
       "7  2017\n",
       "8  2018\n",
       "9  2019"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>origin</th>\n",
       "      <th>asylum</th>\n",
       "      <th>year</th>\n",
       "      <th>refugees</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Syrian Arab Rep.</td>\n",
       "      <td>Türkiye</td>\n",
       "      <td>2021</td>\n",
       "      <td>3737369</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Syrian Arab Rep.</td>\n",
       "      <td>Türkiye</td>\n",
       "      <td>2020</td>\n",
       "      <td>3641370</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Syrian Arab Rep.</td>\n",
       "      <td>Türkiye</td>\n",
       "      <td>2018</td>\n",
       "      <td>3622366</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Syrian Arab Rep.</td>\n",
       "      <td>Türkiye</td>\n",
       "      <td>2019</td>\n",
       "      <td>3576370</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Syrian Arab Rep.</td>\n",
       "      <td>Türkiye</td>\n",
       "      <td>2022</td>\n",
       "      <td>3535898</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Syrian Arab Rep.</td>\n",
       "      <td>Türkiye</td>\n",
       "      <td>2017</td>\n",
       "      <td>3424237</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Afghanistan</td>\n",
       "      <td>Iran (Islamic Rep. of)</td>\n",
       "      <td>2022</td>\n",
       "      <td>3413249</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Syrian Arab Rep.</td>\n",
       "      <td>Türkiye</td>\n",
       "      <td>2016</td>\n",
       "      <td>2823987</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Syrian Arab Rep.</td>\n",
       "      <td>Türkiye</td>\n",
       "      <td>2015</td>\n",
       "      <td>2503549</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Afghanistan</td>\n",
       "      <td>Pakistan</td>\n",
       "      <td>2010</td>\n",
       "      <td>1899842</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             origin                  asylum  year  refugees\n",
       "0  Syrian Arab Rep.                 Türkiye  2021   3737369\n",
       "1  Syrian Arab Rep.                 Türkiye  2020   3641370\n",
       "2  Syrian Arab Rep.                 Türkiye  2018   3622366\n",
       "3  Syrian Arab Rep.                 Türkiye  2019   3576370\n",
       "4  Syrian Arab Rep.                 Türkiye  2022   3535898\n",
       "5  Syrian Arab Rep.                 Türkiye  2017   3424237\n",
       "6       Afghanistan  Iran (Islamic Rep. of)  2022   3413249\n",
       "7  Syrian Arab Rep.                 Türkiye  2016   2823987\n",
       "8  Syrian Arab Rep.                 Türkiye  2015   2503549\n",
       "9       Afghanistan                Pakistan  2010   1899842"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Step 1: Wipe the database\n",
    "my_neo4j_wipe_out_database()\n",
    "\n",
    "# Step 2: Create unified Country nodes (one per country, regardless of role)\n",
    "all_countries = pd.concat([\n",
    "    population[[\"coo_name\", \"coo_iso\"]].rename(columns={\"coo_name\": \"name\", \"coo_iso\": \"iso\"}),\n",
    "    population[[\"coa_name\", \"coa_iso\"]].rename(columns={\"coa_name\": \"name\", \"coa_iso\": \"iso\"})\n",
    "]).drop_duplicates(subset=[\"name\"]).to_dict(\"records\")\n",
    "\n",
    "query_countries = \"\"\"\n",
    "UNWIND $rows AS row\n",
    "MERGE (c:Country {name: row.name})\n",
    "SET c.iso = row.iso\n",
    "\"\"\"\n",
    "session.run(query_countries, rows=all_countries)\n",
    "\n",
    "# Step 3: Create Year nodes\n",
    "year_rows = population[[\"year\"]].drop_duplicates().to_dict(\"records\")\n",
    "query_year = \"\"\"\n",
    "UNWIND $rows AS row\n",
    "MERGE (y:Year {year: row.year})\n",
    "\"\"\"\n",
    "session.run(query_year, rows=year_rows)\n",
    "\n",
    "# Step 4: Create REFUGEES_TO relationships — one per origin/asylum/year combo\n",
    "population_rows = population[[\n",
    "    \"coo_name\", \"coa_name\", \"year\",\n",
    "    \"refugees\", \"asylum_seekers\", \"returned_refugees\",\n",
    "    \"idps\", \"returned_idps\", \"stateless\", \"ooc\", \"hst\"\n",
    "]].fillna(0).to_dict(\"records\")\n",
    "\n",
    "query_relationships = \"\"\"\n",
    "UNWIND $rows AS row\n",
    "MATCH (origin:Country {name: row.coo_name})\n",
    "MATCH (asylum:Country {name: row.coa_name})\n",
    "MATCH (y:Year {year: row.year})\n",
    "MERGE (origin)-[r:REFUGEES_TO {year: row.year}]->(asylum)\n",
    "SET r.refugees        = row.refugees,\n",
    "    r.asylum_seekers  = row.asylum_seekers,\n",
    "    r.returned_refugees = row.returned_refugees,\n",
    "    r.idps            = row.idps,\n",
    "    r.returned_idps   = row.returned_idps,\n",
    "    r.stateless       = row.stateless,\n",
    "    r.ooc             = row.ooc,\n",
    "    r.hst             = row.hst\n",
    "MERGE (origin)-[:IN_YEAR]->(y)\n",
    "MERGE (asylum)-[:IN_YEAR]->(y)\n",
    "\"\"\"\n",
    "session.run(query_relationships, rows=population_rows)\n",
    "\n",
    "# Step 5: Verify\n",
    "df_countries = my_neo4j_run_query_pandas(\"MATCH (c:Country) RETURN c.name AS country, c.iso AS iso LIMIT 10\")\n",
    "df_years     = my_neo4j_run_query_pandas(\"MATCH (y:Year) RETURN y.year AS year ORDER BY y.year LIMIT 10\")\n",
    "df_rels      = my_neo4j_run_query_pandas(\"\"\"\n",
    "    MATCH (o:Country)-[r:REFUGEES_TO]->(a:Country)\n",
    "    RETURN o.name AS origin, a.name AS asylum, r.year AS year, r.refugees AS refugees\n",
    "    ORDER BY r.refugees DESC LIMIT 10\n",
    "\"\"\")\n",
    "\n",
    "display(df_countries)\n",
    "display(df_years)\n",
    "display(df_rels)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "399da318",
   "metadata": {},
   "source": [
    "# Checking GDS version"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "ef999c27",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>version</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2.5.7</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  version\n",
       "0   2.5.7"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Check GDS version\n",
    "query = \"RETURN gds.version() AS version\"\n",
    "df = my_neo4j_run_query_pandas(query)\n",
    "display(df)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "89ecfadf",
   "metadata": {},
   "source": [
    "## Shortest Path Graph - Both Directions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "6fea9ff2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7febd45e6e80>"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Step 1: Drop stale projections\n",
    "for name in ['refugee-graph', 'refugee-graph-reverse']:\n",
    "    session.run(f\"\"\"\n",
    "        CALL gds.graph.exists('{name}') YIELD exists\n",
    "        WITH exists WHERE exists = true\n",
    "        CALL gds.graph.drop('{name}') YIELD graphName\n",
    "        RETURN graphName\n",
    "    \"\"\")\n",
    "\n",
    "# Step 2: Create Graph 1 (Origin -> Asylum)\n",
    "session.run(\"\"\"\n",
    "CALL gds.graph.project(\n",
    "    'refugee-graph',\n",
    "    'Country',\n",
    "    {\n",
    "        REFUGEES_TO: {\n",
    "            orientation: 'NATURAL',\n",
    "            properties: ['refugees']\n",
    "        }\n",
    "    }\n",
    ")\n",
    "\"\"\")\n",
    "\n",
    "# Step 3: Create Graph 2 (Asylum -> Origin)\n",
    "session.run(\"\"\"\n",
    "CALL gds.graph.project(\n",
    "    'refugee-graph-reverse',\n",
    "    'Country',\n",
    "    {\n",
    "        REFUGEES_TO: {\n",
    "            orientation: 'REVERSE',\n",
    "            properties: ['refugees']\n",
    "        }\n",
    "    }\n",
    ")\n",
    "\"\"\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f161be95",
   "metadata": {},
   "outputs": [],
   "source": [
    "'''\n",
    "\n",
    "Understanding each graph:\n",
    "\n",
    "Graph 1 — Origin → Asylum (natural direction)\n",
    "\n",
    "MATCH (origin:Country)-[r:REFUGEES_TO]->(asylum:Country)\n",
    "RETURN origin, r, asylum\n",
    "LIMIT 15\n",
    "\n",
    "\n",
    "Graph 2 — Asylum → Origin (reverse direction)\n",
    "MATCH (origin:Country)-[r:REFUGEES_TO]->(asylum:Country)\n",
    "RETURN asylum, r, origin\n",
    "LIMIT 15\n",
    "\n",
    "\n",
    "Example prompts in Neo4j browser:\n",
    "\n",
    "-- Graph 1: Where do Syrian refugees go?\n",
    "\n",
    "MATCH (origin:Country {name: \"Syrian Arab Rep.\"})-[r:REFUGEES_TO]->(asylum:Country)\n",
    "RETURN origin, r, asylum\n",
    "\n",
    "-- Graph 2: Who sends refugees to Germany?\n",
    "\n",
    "MATCH (origin:Country)-[r:REFUGEES_TO]->(asylum:Country {name: \"Germany\"})\n",
    "RETURN origin, r, asylum\n",
    "\n",
    "'''\n",
    "\n",
    "\n",
    "###"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "41a68fa3",
   "metadata": {},
   "source": [
    "## Betweenness Centraility - Transit Hubs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "bb42cf1b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>country</th>\n",
       "      <th>iso</th>\n",
       "      <th>betweenness_score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>United States of America</td>\n",
       "      <td>USA</td>\n",
       "      <td>9016.857306</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Russian Federation</td>\n",
       "      <td>RUS</td>\n",
       "      <td>2739.240095</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Lebanon</td>\n",
       "      <td>LBN</td>\n",
       "      <td>2419.060225</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Syrian Arab Rep.</td>\n",
       "      <td>SYR</td>\n",
       "      <td>2087.199464</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Venezuela (Bolivarian Republic of)</td>\n",
       "      <td>VEN</td>\n",
       "      <td>1988.791619</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Burundi</td>\n",
       "      <td>BDI</td>\n",
       "      <td>1870.800114</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Türkiye</td>\n",
       "      <td>TUR</td>\n",
       "      <td>1633.003128</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Canada</td>\n",
       "      <td>CAN</td>\n",
       "      <td>1495.926704</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Iraq</td>\n",
       "      <td>IRQ</td>\n",
       "      <td>1138.053969</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Sudan</td>\n",
       "      <td>SDN</td>\n",
       "      <td>1086.865878</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Sri Lanka</td>\n",
       "      <td>LKA</td>\n",
       "      <td>983.707108</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Jordan</td>\n",
       "      <td>JOR</td>\n",
       "      <td>952.208134</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Germany</td>\n",
       "      <td>DEU</td>\n",
       "      <td>886.655154</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Argentina</td>\n",
       "      <td>ARG</td>\n",
       "      <td>881.363432</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>South Africa</td>\n",
       "      <td>ZAF</td>\n",
       "      <td>812.381915</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Mexico</td>\n",
       "      <td>MEX</td>\n",
       "      <td>799.632729</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>India</td>\n",
       "      <td>IND</td>\n",
       "      <td>717.141006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Egypt</td>\n",
       "      <td>EGY</td>\n",
       "      <td>693.827226</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Ukraine</td>\n",
       "      <td>UKR</td>\n",
       "      <td>690.736000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Uganda</td>\n",
       "      <td>UGA</td>\n",
       "      <td>656.121355</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                               country  iso  betweenness_score\n",
       "0             United States of America  USA        9016.857306\n",
       "1                   Russian Federation  RUS        2739.240095\n",
       "2                              Lebanon  LBN        2419.060225\n",
       "3                     Syrian Arab Rep.  SYR        2087.199464\n",
       "4   Venezuela (Bolivarian Republic of)  VEN        1988.791619\n",
       "5                              Burundi  BDI        1870.800114\n",
       "6                              Türkiye  TUR        1633.003128\n",
       "7                               Canada  CAN        1495.926704\n",
       "8                                 Iraq  IRQ        1138.053969\n",
       "9                                Sudan  SDN        1086.865878\n",
       "10                           Sri Lanka  LKA         983.707108\n",
       "11                              Jordan  JOR         952.208134\n",
       "12                             Germany  DEU         886.655154\n",
       "13                           Argentina  ARG         881.363432\n",
       "14                        South Africa  ZAF         812.381915\n",
       "15                              Mexico  MEX         799.632729\n",
       "16                               India  IND         717.141006\n",
       "17                               Egypt  EGY         693.827226\n",
       "18                             Ukraine  UKR         690.736000\n",
       "19                              Uganda  UGA         656.121355"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Step 1: Now run betweenness\n",
    "session.run(\"\"\"\n",
    "CALL gds.betweenness.write('refugee-graph', {\n",
    "    writeProperty: 'betweenness'\n",
    "})\n",
    "\"\"\")\n",
    "\n",
    "df_betweenness = my_neo4j_run_query_pandas(\"\"\"\n",
    "MATCH (c:Country)\n",
    "WHERE c.betweenness > 0\n",
    "RETURN c.name AS country, c.iso AS iso, c.betweenness AS betweenness_score\n",
    "ORDER BY betweenness_score DESC\n",
    "LIMIT 20\n",
    "\"\"\")\n",
    "display(df_betweenness)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "46563f3a",
   "metadata": {},
   "outputs": [],
   "source": [
    "'''\n",
    "Understanding the graph, do this to see all countries and thier scores:\n",
    "\n",
    "MATCH (c:Country)\n",
    "WHERE c.betweenness > 0\n",
    "RETURN c\n",
    "ORDER BY c.betweenness DESC\n",
    "LIMIT 10\n",
    "\n",
    "\n",
    "Example prompt for Neo4j browser:\n",
    "\n",
    "MATCH (origin:Country)-[r:REFUGEES_TO]->(asylum:Country)\n",
    "WHERE origin.betweenness > 500\n",
    "RETURN origin, r, asylum\n",
    "LIMIT 10\n",
    "\n",
    "'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "39cf6738",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
